amarildolacerda/bridge/clients/esp8266_dimmable/src/main.cpp
    Serial.printf("[%s] Configuration portal timed out\n", TAG);
    s_wifi_configuration_mode = false;
    return false;
}

static void maintain_wifi_connection(void)
{
    if (WiFi.status() == WL_CONNECTED)
        return;
    unsigned long now = millis();
    if (now - s_last_reconnect_attempt < 30000)
        return;
    s_last_reconnect_attempt = now;

    Serial.printf("[%s] WiFi disconnected. Reconnecting...\n", TAG);
    WiFi.begin();
    unsigned long connect_start = millis();
    while (millis() - connect_start < 15000)
    {
        if (WiFi.status() == WL_CONNECTED)
        {
            Serial.printf("[%s] Reconnected! IP: %s\n", TAG, WiFi.localIP().toString().c_str());
            return;
        }
        delay(500);
    }

    static unsigned long last_config_attempt = 0;
    if (now - last_config_attempt > 300000)
    {
        last_config_attempt = now;
        wifi_setup(true);
    }
}

static void init_hardware(void)
{
    pinMode(PWM_PIN, OUTPUT);
    analogWriteFreq(PWM_FREQ);
    analogWriteRange(1023);
    analogWrite(PWM_PIN, 0);

#ifdef BUTTON_PIN
    pinMode(BUTTON_PIN, INPUT_PULLUP);
#endif

#ifdef LED_PIN
    pinMode(LED_PIN, OUTPUT);
    digitalWrite(LED_PIN, LOW);
#endif
}

static void check_config_portal_timeout(void)
{
    if (s_wifi_configuration_mode && (millis() - s_wifi_config_start_time > 600000))
    {
        Serial.printf("[%s] Config portal timeout. Restarting...\n", TAG);
        ESP.restart();
    }
}

static void handle_root(void)
{
    s_server.send(200, "text/html", FPSTR(PAGE_DASHBOARD));
}

static void handle_api_state(void)
{
    String json;
    {
        JsonDocument doc;
        doc["level"] = s_level;
        doc["on"] = s_on;
        doc["battery"] = s_battery;
        doc["device_id"] = s_device_id;
        doc["device_name"] = s_device_name;
        doc["bridge_connected"] = s_bridge_connected;
        doc["ip"] = WiFi.localIP().toString();
        doc["rssi"] = WiFi.RSSI();
        doc["uptime_s"] = (millis() - s_start_time) / 1000;
        if (s_last_send_ms) doc["last_send_s"] = (millis() - s_last_send_ms) / 1000;
        serializeJson(doc, json);
    }
    s_server.send(200, "application/json", json);
}

static void handle_api_set(void)
{
    if (s_server.method() != HTTP_POST) {
        s_server.send(405, "application/json", "{\"error\":\"method not allowed\"}");
        return;
    }
    String body = s_server.arg("plain");
    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, body);
    if (error) {
        s_server.send(400, "application/json", "{\"error\":\"invalid json\"}");
        return;
    }
    int level = doc["level"] | 0;
    level = constrain(level, 0, 100);
    s_level = level;
    s_on = (level > 0);
    analogWrite(PWM_PIN, map(s_level, 0, 100, 0, 1023));
    send_state(true);

    JsonDocument resp;
    resp["status"] = "ok";
    resp["level"] = s_level;
    resp["on"] = s_on;
    String json;
    serializeJson(resp, json);
    s_server.send(200, "application/json", json);
}

static void handle_serial(void)
{
    if (Serial.available() <= 0)
        return;
    char c = Serial.read();
    switch (c)
    {
        case 'R':
        case 'r':
            ESP.restart();
            break;
        case 'l':
        case 'L':
            Serial.printf("\n--- Leitura forçada ---\n");
            Serial.printf("  Nivel:     %d %%\n", s_level);
            Serial.printf("  Estado:    %s\n", s_on ? "LIGADO" : "DESLIGADO");
            Serial.printf("  PWM:       %d / 1023\n", map(s_level, 0, 100, 0, 1023));
            Serial.printf("  Bateria:   %d %%\n", s_battery);
            if (s_bridge_discovered && s_bridge_connected)
            {
                s_last_state_update = 0;
                send_state(true);
            }
            else
            {
                Serial.printf("  (bridge desconectado)\n");
            }
            Serial.printf("------------------------\n\n");
            break;
        case 'u':
        case 'U':
            Serial.printf("\n--- OTA ---\n");
            Serial.printf("  Hostname: %s.local\n", s_device_id);
            Serial.printf("  Port:     8266 (ArduinoOTA)\n");
            Serial.printf("  PlatformIO CLI:\n");
            Serial.printf("    pio run -t upload --upload-port %s.local\n", s_device_id);
            Serial.printf("  espota.py:\n");
            Serial.printf("    espota.py -i %s.local -p 8266 -f firmware.bin\n", s_device_id);
            Serial.printf("-------------\n\n");
            break;
        case 'h':
        case 'H':
        case '?':
            Serial.printf("\n--- Comandos ---\n");
            Serial.printf("  l    - ler estado agora\n");
            Serial.printf("  r    - reset\n");
            Serial.printf("  s    - status do dispositivo\n");
            Serial.printf("  u    - info OTA\n");
            Serial.printf("  h/?  - esta ajuda\n");
            Serial.printf("  Browser: http://%s\n", WiFi.localIP().toString().c_str());
            if (s_bridge_discovered)
                Serial.printf("  Bridge:  http://%s:%d\n", s_bridge_host, s_bridge_port);
            Serial.printf("  IP local: %s\n", WiFi.localIP().toString().c_str());
            Serial.printf("  RSSI:     %d dBm\n", WiFi.RSSI());
            Serial.printf("  Up:       %lu s\n", (millis() - s_start_time) / 1000);
            Serial.printf("----------------\n\n");
            break;
        case 's':
        case 'S':
        {
            unsigned long up = (millis() - s_start_time) / 1000;
            Serial.printf("\n--- Status ---\n");
            Serial.printf("  Dispositivo: %s\n", s_device_id);
            Serial.printf("  Nome:        %s\n", s_device_name);
            Serial.printf("  Tipo:        %s\n", get_device_type_string());
            Serial.printf("  Nivel:       %d %%\n", s_level);
            Serial.printf("  Estado:      %s\n", s_on ? "LIGADO" : "DESLIGADO");
            Serial.printf("  PWM:         %d / 1023\n", map(s_level, 0, 100, 0, 1023));
            Serial.printf("  Bateria:     %d %%\n", s_battery);
            Serial.printf("  Bridge:      http://%s:%d (%s)\n", s_bridge_host, s_bridge_port,
                          s_bridge_connected ? "conectado" : "desconectado");
            Serial.printf("  Browser:     http://%s\n", WiFi.localIP().toString().c_str());
            Serial.printf("  RSSI:        %d dBm\n", WiFi.RSSI());
            Serial.printf("  Uptime:      %lu s\n", up);
            Serial.printf("---------------\n\n");
            break;
        }
    }
}

void setup(void)
{
    Serial.begin(115200);
    delay(1000);
    s_start_time = millis();

    uint32_t chip_id = ESP.getChipId();
    snprintf(s_device_id, sizeof(s_device_id), "esp8266_%06x", chip_id);

    load_device_name();

    Serial.printf("\n");
    Serial.printf("============================================\n");
    Serial.printf("  ESP8266 Dimmable Light v1.0\n");
    Serial.printf("  Device : %s\n", s_device_id);
    Serial.printf("  Nome   : %s\n", s_device_name);
    Serial.printf("  Tipo   : %s\n", get_device_type_string());
    Serial.printf("============================================\n");

